13/data/attachments/e81cf36761f456fc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>James_may_Friend_64801_8</nif:username>
            <nif:friendToBeRequested>soap_friends_412cd2e6-78d5-4f38-9450-89a55b54f750</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>